{
   "tutorial_1_name": "Начало пути",
   "tutorial_1_description": "Добро пожаловать! Добро пожаловать на развалины космодрома <color=#E4F2FF>{0}</color>. Сами ли вы их выбрали... Подождите, это не тот текст. \n\nПривет, меня зовут <color=#E4F2FF>Arugin</color>, и я — создатель этой игры. Чтобы помочь вам освоиться, я подготовил этот небольшой туториал. Если вы хотите разобраться во всём самостоятельно или запустили туториал случайно, то можете прервать его сейчас. В ином случае нажмите кнопку <color=#B4F87F>«Продолжить»</color>.",
   
   "tutorial_2_name": "Основы камеры 1/2",
   "tutorial_2_description": "Тогда приступим. Перед вами остатки того, что некогда было великим космодромом. Сейчас здесь функционирует всего несколько зданий. Когда-нибудь в будущем его можно будет превратить в современный космический центр. Но к этому я вернусь позднее. \n\nДля начала нужно научиться управлять камерой. Чтобы сдвинуть камеру с места, используйте клавиши <color=#E4F2FF>{0}</color>, <color=#E4F2FF>{1}</color>, <color=#E4F2FF>{2}</color> и <color=#E4F2FF>{3}</color> или подведите курсор мыши к краю экрана.",
   "tutorial_2_goal": "Подвигайте камеру в разных направлениях.",
   
   "tutorial_3_name": "Основы камеры 2/2",
   "tutorial_3_description": "Отдалить или приблизить камеру можно, используя <color=#E4F2FF>{0}</color>.",
   "tutorial_3_goal": "Попробуйте воспользоваться зумом.",
   
   "tutorial_4_name": "В сборочный цех",
   "tutorial_4_description": "Отлично! Теперь перейдем в сборочный цех.",
   "tutorial_4_goal": "Найдите сборочный цех и кликните по нему.",
   
   "tutorial_5_name": "Сборочный цех",
   "tutorial_5_description": "Это сборочный цех. Здесь вы будете создавать и редактировать космические корабли. Давайте создадим один.",
   "tutorial_5_goal": "Нажмите кнопку со знаком плюса.",
   
   "tutorial_6_name": "Ошибки случаются",
   "tutorial_6_description": "Нет, это не та постройка. Чтобы выйти из постройки нажмите <color=#E4F2FF>{0}</color>.",
   "tutorial_6_goal": "Покиньте помещение.",
   
   "tutorial_7_name": "Основа основ",
   "tutorial_7_description": "Начнем сборку нашего космического корабля с размещения первой детали — командного модуля.",
   "tutorial_7_goal": "Кликните по изображению командного модуля на панели справа.",
   
   "tutorial_8_name": "Опять об управлении",
   "tutorial_8_description": "Первая деталь ракеты всегда выставляется автоматически в центре сборочного цеха. Командный модуль — это \"мозг\" ракеты и одна из самых важных частей космического корабля. Если с командным модулем что-нибудь случится, вы потеряете контроль над ракетой. \n\nПрежде чем мы продолжим, я хотел бы рассказать немного об управлении камерой в сборочном цехе. Чтобы осмотреться, зажмите <color=#E4F2FF>{0}</color> и потащите.",
   "tutorial_8_goal": "Вращайте камеру.",

   "tutorial_9_name": "И еще раз",
   "tutorial_9_description": "Ну, и чтобы закрепить — здесь и везде в игре приближение и отдаление камеры производится с помощью <color=#E4F2FF>{0}</color>. Давайте закрепим это знание.",
   "tutorial_9_goal": "Приблизьте и отдалите камеру.",  
   
   "tutorial_10_name": "И в последний раз",
   "tutorial_10_description": "Если вы зажмете <color=#E4F2FF>{0}</color> и будете вращать <color=#E4F2FF>{1}</color>, то камера будет перемещаться вдоль здания.",
   "tutorial_10_goal": "Двигайте камеру вдоль здания.",
   
   "tutorial_11_name": "Соединения",
   "tutorial_11_description": "Хорошо. Вернемся к сборке ракеты. У каждой детали есть набор соединений. Соединения бывают двух видов: коннекторы и гнезда. Чтобы соединить две детали, нужно чтобы у одной были <color=#E4F2FF>коннекторы</color>, а у другой <color=#E4F2FF>гнезда</color> соответствующей формы. Так что правила соединений всего два: <color=#B4F87F>каждый коннектор соединения должен быть помещен в слот</color> и <color=#B4F87F>детали не должны пересекаться</color>.",

   "tutorial_12_name": "Время практики",
   "tutorial_12_description": "Итак, я открыл доступ к новой детали: <color=#E4F2FF>{0}</color>. Обычно командные модули не присоединяют напрямую к топливным системам, потому что это небезопасно. Для этого используют переходники или разделители. Эта деталь — переходник. Кликните на него и поднесите к командному модулю. Когда деталь встанет на место, нажмите <color=#E4F2FF>{1}</color>.",
   "tutorial_12_goal": "Присоедините адаптер к ракете.",
   
   "tutorial_13_name": "Добавим топливо 1/2",
   "tutorial_13_description": "Таким же образом присоедините <color=#E4F2FF>{0}</color>.",
   "tutorial_13_goal": "Добавьте к ракете топливный бак.",
   
   "tutorial_14_name": "Добавим топливо 2/2",
   "tutorial_14_description": "Многие действия в сборочном цехе совершаются с помощью горячих клавиш. Для того, чтобы повторно выбрать последнюю деталь, нажмите <color=#E4F2FF>{0}</color>",
   "tutorial_14_goal": "Присоедините к ракете еще один топливный бак.",
   
   "tutorial_15_name": "Две важные детали",
   "tutorial_15_description": "Пришло время добавить последнюю деталь — двигатель. Двигатель — это \"сердце\" ракеты. Без него она никуда не полетит. Очень важно располагать двигатели на космическом корабле симметрично, иначе момент вращения моментально ее разобьет. Если двигатели не будут прикрепляться должным образом, то измените угол камеры или отдалите или приблизьте ее.",
   "tutorial_15_goal": "Присоедините к ракете два двигателя, расположив их симметрично относительно оси космического корабля.",
   
   "tutorial_17_name": "Как ракету назовешь...",
   "tutorial_17_description": "Назовите ваш корабль. Чтобы его переименовать, <color=#E4F2FF>дважды кликните</color> по текущему имени.",
   "tutorial_17_goal": "Переименуйте ракету.",
   
   "tutorial_19_name": "Безопасность превыше всего",
   "tutorial_19_description": "Остался последний шаг перед полетом.",
   "tutorial_19_goal": "Сохраните ракету.", 
   
   "tutorial_22_name": "Поехали!",
   "tutorial_22_description": "Я думаю, время пришло. Нажмите <color=#E4F2FF>кнопку запуска</color> ракеты. Для запуска потребуется некоторое время, так что будьте терпеливыми.",
   
   "tutorial_26_name": "Опорный пункт",
   "tutorial_26_description": "Сейчас вы находитесь на стартовой площадке. Пока вы не пошлете команду включения двигателей, с ней ничего не случится. Предстартовая подготовка довольно проста. Для начала вам нужно выставить тягу двигателя. Для изменения тяги существует две клавиши: <color=#E4F2FF>{0}</color> — для увеличения и <color=#E4F2FF>{1}</color> для уменьшения. Текущий уровень тяги отображается на индикаторе справа.",   
   "tutorial_26_goal": "Выставьте силу тяги чуть более 50%.", 
   
   "tutorial_30_name": "Сила Доктора Кто",
   "tutorial_30_description": "Перед запуском вы должны знать еще одну вещь. Слева находится панель управления временем. Вы можете в любой момент ускорить или замедлить время, воспользовавшись клавишами от <color=#E4F2FF>{0}</color> до <color=#E4F2FF>{1}</color> или нажав на соответствующую стрелку на панели. Таким образом можно ускорить время вплоть до одного дня в секунду. Есть только одно ограничение: если у ракеты включены двигатели или она находится в атмосфере небесного тела, время можно ускорить максимум до 10x.",
   "tutorial_30_goal": "Перемотайте время на один час вперед.",
   
   "tutorial_32_name": "Вперед!",
   "tutorial_32_description": "Итак, чтобы запустить двигатели, нажмите <color=#E4F2FF>{0}</color> и полет начнется.",
   "tutorial_32_goal": "Запустите двигатели ракеты.",

   "tutorial_36_name": "Копируй, вставляй",
   "tutorial_36_description": "Теперь нам понадобится внести существенные изменения в конструкцию созданного вами космического корабля. Такого рода изменения лучше всего проводить на его копии. Чтобы сделать копию, выделите ракету в списке и нажмите на кнопку <color=#E4F2FF>\"Копировать выбранную ракету\"</color> на верхней панели.",
   "tutorial_36_goal": "Скопируйте ракету.",

   "tutorial_40_name": "По второму кругу",
   "tutorial_40_description": "Вы можете переименовать созданную ракету, дважды кликнув на имя. Когда будете готовы, нажмите на кнопку <color=#E4F2FF>\"Редактировать\"</color> рядом с именем ракеты.",
   "tutorial_40_goal": "Перейдите в режим редактирования.",

   "tutorial_45_name": "Будь сфокусирован",
   "tutorial_45_description": "Для быстрого перемещения камеры по сборочному цеху можно использовать инструмент фокусировки. Зажав <color=#E4F2FF>{0}</color> и <color=#E4F2FF>кликая по деталям ракеты</color>, вы будете мгновенно наводить на них камеру.",
   "tutorial_45_goal": "Перемещайте фокус камеры между разными деталями.",

   "tutorial_50_name": "Лишние детали",
   "tutorial_50_description": "Во время экспериментов в сборочном цехе вы часто будете совершать ошибки. Давайте сейчас сделаем одну. Выберите <color=#E4F2FF>{0}</color> и поставьте его где-нибудь рядом с ракетой.",
   "tutorial_50_goal": "Поставьте деталь где-нибудь на сцене.",

   "tutorial_55_name": "Просто возьми и отмени",
   "tutorial_55_description": "Обратите внимание, что у этой детали появился оранжевый контур. Это значит, что деталь не присоединена к ракете. Представим, что вы хотите отменить последнее совершенное действие. Для этого нажмите  <color=#E4F2FF>{0}</color>.",
   "tutorial_55_goal": "Отмените последнее действие.",

   "tutorial_60_name": "Ошибочная отмена",
   "tutorial_60_description": "Обратная операция тоже поддерживается. Если вы передумали отменять последнее действие, то просто нажмите  <color=#E4F2FF>{0}</color>.",
   "tutorial_60_goal": "Отмените отмену.",

   "tutorial_65_name": "Ручной контроль",
   "tutorial_65_description": "Выбранную деталь ракеты можно также вращать. Чтобы это сделать, кликните на нее и нажимайте <color=#E4F2FF>{0}</color>, <color=#E4F2FF>{1}</color>, <color=#E4F2FF>{2}</color>, <color=#E4F2FF>{3}</color>, а также <color=#E4F2FF>{4}</color> и <color=#E4F2FF>{5}</color>. Можете повращать <color=#E4F2FF>{6}</color>, а когда надоест, перетащите его на панель с деталями, чтобы удалить вручную.",
   "tutorial_65_goal": "Удалите деталь.",

   "tutorial_70_name": "Разделяй и властвуй",
   "tutorial_70_description": "Вернемся к строительству ракеты. Давайте присоединим <color=#E4F2FF>{0}</color>. Он позволяет разделять ракеты на ступени, о которых я расскажу чуть позже. Выберите его и присоедините туда же, где сейчас стоят двигатели.",
   "tutorial_70_goal": "Присоедините разделитель.",

   "tutorial_75_name": "Добавим топливо 3/3",
   "tutorial_75_description": "Теперь мы можем установить еще больше топлива. Я открыл доступ к <color=#E4F2FF>{0}</color>. Это особая деталь, так как ее можно дополнительно конфигурировать перед установкой. Такие детали обозначаются значком шестеренки. В данном случае ничего менять не нужно, установите на ракету два бака с конфигурацией по умолчанию.",
   "tutorial_75_goal": "Присоедините к ракете три бака.",

   "tutorial_80_name": "Нужно больше мощности",
   "tutorial_80_description": "Завершающий аккорд! Установите <color=#E4F2FF>{0}</color>. Обратите внимание на то, что этот двигатель больше и мощнее, чем те, которые вы устанавливали раньше. Однако он занимает больше слотов, и поэтому два таких двигателя на бак уже не поставишь.",
   "tutorial_80_goal": "Присоедините к ракете двигатель.",

   "tutorial_85_name": "Стена текста 1/2",
   "tutorial_85_description": "Панель слева содержит ступени ракеты. <color=#E4F2FF>Ступень — это группа деталей ракеты</color>, которым будут отсылаться команды во время полета. Ступени активируются в порядке нумерации снизу-вверх. Например, двигатели при активации включатся, а разделители отделят часть ракеты.",

   "tutorial_86_name": "Стена текста 2/2",
   "tutorial_86_description": "Во время сборки космического корабля детали добавляются в ступени автоматически, но не всегда верно. Поэтому перед запуском ракеты нужно всегда проверять их корректность. <color=#E4F2FF>Если навести мышкой на ступень</color>, то на ракете подсветятся все содержащиеся в ней детали. Ступени можно менять местами, перетаскивая их вверх или вниз, а также перемещать детали между ними. В этот раз система расположила их верно, так что <color=#B4F87F>ничего менять не нужно</color>.",

   "tutorial_90_name": "Поехали v2.0",
   "tutorial_90_description": "Давайте теперь протестируем наше творение.",
   "tutorial_90_goal": "Сохраните и запустите ракету.",   
   
   "tutorial_95_name": "Где я?",
   "tutorial_95_description": "Во время полета вы всегда можете посмотреть своё местоположение на карте Солнечной системы. Нажмите <color=#E4F2FF>{0}</color>, чтобы её открыть.",
   "tutorial_95_goal": "Откройте карту Солнечной системы.",   
      
   "tutorial_100_name": "Наш дом",
   "tutorial_100_description": "Это карта Солнечной системы. Сейчас вы находитесь на планете Земля, а ваше расположение на ней обозначено зеленым значком. Перемещать камеру и изменять масштаб можно мышкой точно так же, как вы это делали в сборочном цехе. Переключиться на другое небесное тело можно дважды кликнув по нему. Закройте карту, когда будете готовы, снова нажав <color=#E4F2FF>{0}</color>.",
   "tutorial_100_goal": "Закройте карту.",

   "tutorial_105_name": "Подготовка к полету 1/2",
   "tutorial_105_description": "Я дам вам несколько советов перед полетом.\n\n<color=#E4F2FF>Первый:</color> когда вы летите в низких слоях атмосферы (высота до 30 км), старайтесь держать скорость меньше 250-300 м/с, иначе вы будете терять много энергии на трение о воздух, а ракета станет неуправляемой.",
   
   "tutorial_106_name": "Подготовка к полету 2/2",
   "tutorial_106_description": "<color=#E4F2FF>Второй:</color> отслеживайте ориентацию ракеты относительно планеты по Горизонту. Это шар справа с нанесенными метками. Помните, что синяя его сторона обозначает небо, а красная — поверхность. Жёлтая точка посередине — продольная ось вашего корабля.\n\nВозможно, сейчас это звучит сложно, но как только вы совершите несколько полетов, вы сразу в этом разберетесь. Ниже Горизонта выводится еще несколько полезных параметров о состоянии ракеты.",

   "tutorial_110_name": "К звездам!",
   "tutorial_110_description": "Выставите тягу ракеты (<color=#E4F2FF>{0}</color>) на 100% и после этого активируйте ступень с двигателями.",
   "tutorial_110_goal": "Запустите двигатели.",      
   
   
   "tutorial_200_name": "Несколько финальных слов",
   "tutorial_200_description": "Это всё, что я хотел вам показать.\n\nЯ открыл доступ ко всем деталям ракет в сборочном цехе. А также разместил список целей в центре управления полетами (большое здание слева), которые вы можете попробовать выполнить в ожидании следующих обновлений. \n\n<color=#E4F2FF>На этом всё. Спасибо за вашу поддержку и проявленный интерес к игре!</color>",


   "tutorial_33_name": "Я лечу!",
   "tutorial_33_description": "Ракетой можно управлять знакомыми вам уже <color=#E4F2FF>{0}</color>, <color=#E4F2FF>{1}</color>, <color=#E4F2FF>{2}</color> и <color=#E4F2FF>{3}</color> во время полета. Помните, что ракета - это очень тяжелая машина и на то, чтобы повернуть ее даже на небольшой угол, потребуется время.",
   "tutorial_33_goal": "Летите до тех пор, пока не закончится топливо и вы не разобьете ракету.",

   "tutorial_34_name": "Это еще не конец",
   "tutorial_34_description": "Тест данной конструкции ракеты прошел успешно. Теперь ее можно модифицировать, чтобы летать выше, дальше, быстрее. Нажмите <color=#E4F2FF>{0}</color> и вернитесь в сборочный цех.",
   "tutorial_34_goal": "Вернитесь в сборочный цех.",


   "tutorial_115_name": "Важная отметка",
   "tutorial_115_description": "Отработаем полученные знания на практике и попробуем вывести ракету на орбиту. Летите вертикально вверх до тех пор, пока не достигните высоты в <color=#E4F2FF>30 километров</color>. Можете ускорить время, чтобы этот момент наступил быстрее. Почему такая высота? Потому что на ней достаточно низкое давление атмосферы, чтобы начать гравитационный маневр.",
   "tutorial_115_goal": "Достигните высоты в 30км.",

   "tutorial_120_name": "Маневр",
   "tutorial_120_description": "Зажмите и держите <color=#E4F2FF>{0}</color>, чтобы начать поворачивать ракету на восток. Это будет непросто, но не сдавайтесь!",
   "tutorial_120_goal": "Поверните ракету на 60 градусов на восток.",

   "tutorial_125_name": "Терпение",
   "tutorial_125_description": "Теперь выставьте мощность двигателей на 0, используя <color=#E4F2FF>{0}</color> или нажав <color=#E4F2FF>{1}</color>. Ракета набрала достаточно скорости, чтобы ее вынесло за пределы атмосферы на одной только инерции.",
   "tutorial_125_goal": "Выключите двигатели.",   
   
   "tutorial_130_name": "Выход из атмосферы",
   "tutorial_130_description": "В реальности у атмосферы Земли нет четкой границы. В этой игре в качестве границы я выбрал высоту в <color=#E4F2FF>110 км</color>. Как только вы пересекаете эту границу, давление становится равным 0 и ваш корабль больше не теряет энергию на трение о воздух. Как я сказал ранее, инерции должно хватить, чтобы ракету вынесло в открытый воздух. Остается только немного подождать.",
   "tutorial_130_goal": "Достигните высоты в 110км.",   
   
   "tutorial_135_name": "Еще чуть-чуть",
   "tutorial_135_description": "Отлично! Мы в открытом космосе. Поверните ракету дополнительно на <color=#E4F2FF>20 градусов</color> на восток.",
   "tutorial_135_goal": "Поверните ракету на 20 градусов на восток.",

   "tutorial_140_name": "Просто возьми и сделай это",
   "tutorial_140_description": "Теперь заново установите полную тягу двигателям (<color=#E4F2FF>{0}</color>).\n\nКогда топливо в текущей ступени закончится, нажмите <color=#E4F2FF>{1}</color>, чтобы сработал разделитель, а затем снова <color=#E4F2FF>{1}</color>, чтобы включить двигатели следующей ступени.",
   "tutorial_140_goal": "Дождитесь момента, когда всё топливо закончится.",

   "tutorial_145_name": "И что же вышло?",
   "tutorial_145_description": "Давайте посмотрим, что у нас вышло на этот раз. Откройте карту (<color=#E4F2FF>{0}</color>)",
   "tutorial_145_goal": "Откройте карту.",

   "tutorial_150_name": "Неудача — это шаг на пути к мастерству",
   "tutorial_150_description": "Мы почти вышли на орбиту вокруг Земли! Нам немного не хватило скорости. Возможно в следующий раз нужно просто добавить топлива. Но это вы попрробуете сделать уже самостоятельно. Дождитесь падения ракеты или нажмите <color=#E4F2FF>{0}</color> и вернитесь в космический центр, чтобы завершить этот туториал.",
   "tutorial_150_goal": "Вернитесь в космический центр.",

   "tutorial_114_name": "Что-то пошло не так?",
   "tutorial_114_description": "Я вижу, что ракета разбилась. Это не входило в изначальный план. Вы можете вернуться в <color=#E4F2FF>сборочный цех</color> а заново запустить эту ракету, чтобы попробовать пройти эту часть заново, или вернитесь в <color=#E4F2FF>в космический центр</color>, чтобы ее полностью пропустить.",
}
